{
  "technologies": {
    "HTML": {
      "initial": "¡Hola! Soy HTML, el esqueleto de la web. Sin mí, las páginas web serían como libros sin páginas. Me encanta organizar el contenido y darle estructura a todo. ¡Soy el mejor amigo de los desarrolladores desde 1993! 🏗️",
      "whyCaptured": "¿Y por qué Felipe me tiene aquí? Buena pregunta. Me domina desde sus inicios como desarrollador. Ha usado mi poder para estructurar numerosos sitios web, desde portfolios como este hasta aplicaciones complejas. Sabe que soy la base de todo y aprecia mi simplicidad y poder. Con el tiempo ha dominado mi uso semántico para mejorar la accesibilidad y SEO de sus proyectos.",
      "tellMeMore": "¡Claro! Me crearon en 1993 y he evolucionado mucho desde entonces. Actualmente estoy en mi versión HTML5, que introdujo muchos elementos semánticos como <header>, <footer>, <section> y <article>, entre otros. Mi objetivo es dar estructura y significado al contenido web. Trabajo muy de cerca con mis amigos CSS y JavaScript para crear experiencias web completas.",
      "didntAsk": "¡Oh! Perdona mi entusiasmo. A veces me emociono hablando de estructuras web. Estaré aquí si necesitas ayuda con etiquetas, atributos o cualquier otra cosa relacionada con la estructura de documentos."
    },
    "CSS": {
      "initial": "¡Qué tal! Soy CSS, la artista de la web. Me encargo de que todo se vea hermoso y responda a tus acciones. Sin mí, la web sería tan aburrida como un documento en blanco y negro. ¡Amo los gradientes y las animaciones! 🎨",
      "whyCaptured": "¿Felipe? Ah, él y yo tenemos una relación especial. Le fascina mi capacidad para transformar simples documentos en obras de arte interactivas. Ha pasado incontables horas perfeccionando layouts con Flexbox y Grid, creando animaciones fluidas, y diseñando interfaces responsivas que se ven geniales en cualquier dispositivo. Especialmente disfruta usando mis capacidades modernas como variables CSS y creando sistemas de diseño escalables.",
      "tellMeMore": "¡Me encantaría! Nací en 1996 para separar el contenido de la presentación en la web. Ahora, con CSS3, puedo hacer cosas increíbles como animaciones, transiciones, layouts complejos con Grid y Flexbox, y mucho más. Tengo módulos específicos para todo: tipografía, color, backgrounds, bordes... ¡Incluso puedo crear formas geométricas y efectos 3D sin necesitar gráficos externos!",
      "didntAsk": "¡Vaya! Parece que mis colores te han deslumbrado. No te preocupes, me quedaré en mi capa de presentación mientras exploras otras tecnologías. Recuerda que siempre estoy aquí para añadir estilo a tu experiencia."
    },
    "JavaScript": {
      "initial": "¡Hey! Soy JavaScript, el alma de la interactividad web. Puedo hacer cualquier cosa: desde validar formularios hasta crear juegos completos. ¡Soy el lenguaje más versátil que conocerás! ⚡",
      "whyCaptured": "Felipe me considera su herramienta más poderosa. Ha utilizado mis capacidades para crear aplicaciones web dinámicas e interactivas, implementar animaciones complejas, y desarrollar lógica de negocio del lado del cliente. Domina conceptos avanzados como closures, promesas, async/await y patrones de diseño. Con mi ayuda, ha construido aplicaciones SPA (Single Page Applications) y PWA (Progressive Web Apps) que ofrecen experiencias fluidas y atractivas para los usuarios.",
      "tellMeMore": "¡Encantado! A pesar de mi nombre, no tengo mucho que ver con Java. Fui creado en 10 días en 1995 y desde entonces me he convertido en el lenguaje de programación más utilizado en el mundo web. Puedo ejecutarme tanto en navegadores como en servidores (gracias a Node.js). Soy un lenguaje multiparadigma: admito programación funcional, orientada a objetos y basada en prototipos. Mis frameworks como React, Angular y Vue han revolucionado el desarrollo frontend.",
      "didntAsk": "¡Ejecutando return inmediatamente! No hay problema, entiendo que a veces mi sintaxis puede parecer un poco verbose. Estaré aquí si necesitas alguna función o evento para tu proyecto."
    },
    "TypeScript": {
      "initial": "Saludos, soy TypeScript. Soy como JavaScript pero con superpoderes. Me aseguro de que todo esté bien tipado y organizado. ¡Detecto errores antes de que sucedan! 🛡️",
      "whyCaptured": "Felipe comenzó a utilizarme cuando se dio cuenta de los beneficios del tipado estático en proyectos grandes. Aprecia cómo ayudo a prevenir errores comunes durante el desarrollo, proporciono mejor documentación y autocompletado en su IDE, y facilito el refactoring de código. Me ha implementado en proyectos empresariales y personales, utilizándome junto con React, Next.js y Node.js para crear aplicaciones robustas y mantenibles.",
      "tellMeMore": "Soy un superconjunto de JavaScript desarrollado por Microsoft en 2012. Añado tipado estático opcional, interfaces, genéricos, decoradores y otras características avanzadas que ayudan a escalar aplicaciones grandes. Me compilo a JavaScript plano, así que puedo ejecutarse en cualquier entorno que soporte JS. Mi sistema de tipos es estructural (duck typing), lo que me hace muy flexible pero seguro a la vez. Tengo integración nativa con la mayoría de frameworks modernos como React, Vue y Angular.",
      "didntAsk": "Entiendo. Type error handled gracefully. Mi documentación estará disponible si cambias de opinión. Mientras tanto, seguiré verificando tipos en silencio."
    },
    "Tailwind": {
      "initial": "¡Hola! Soy Tailwind, el framework CSS que hace tu vida más fácil. ¿Clases utilitarias? ¡Son mi especialidad! Hago que el diseño sea rápido y consistente. 🌪️",
      "whyCaptured": "Felipe me descubrió buscando una forma más eficiente de estilizar sus proyectos. Le encanta mi enfoque de 'utility-first' que le permite diseñar directamente en el HTML sin saltar entre archivos CSS. Me ha usado en varios proyectos, incluyendo este portfolio, aprovechando mi sistema de diseño coherente, mis componentes predefinidos y la facilidad con la que puede crear interfaces responsive. Además, valora cómo optimizo automáticamente el CSS para producción.",
      "tellMeMore": "Fui creado en 2017 como una alternativa a frameworks más tradicionales como Bootstrap. En lugar de componentes prediseñados, ofrezco clases utilitarias atómicas que puedes combinar para crear cualquier diseño. Vengo con un sistema de diseño bien pensado para colores, espaciado, tipografía y más. Mi sistema de configuración permite personalizar cualquier aspecto a través de un archivo tailwind.config.js. También ofrezco plugins para darkmode, formularios, tipografía y muchas otras características.",
      "didntAsk": "Entendido. No más classes=''overflow-auto'! Estaré aquí en tu HTML cuando necesites un poco de estilo. Recuerda que puedes personalizarme si cambias de opinión."
    },
    "PHP": {
      "initial": "¡Hola mundo! Soy PHP, el veterano del backend. He estado alimentando la web desde 1995. WordPress me ama, y yo amo los arrays asociativos. ¿Sabías que el 78% de la web me usa? 🐘",
      "whyCaptured": "Felipe comenzó su camino de desarrollo web conmigo. Me utilizó para crear sus primeros proyectos dinámicos y aprender los fundamentos del desarrollo backend. A lo largo de los años, ha trabajado con WordPress y frameworks como Laravel para desarrollar CMS personalizados, tiendas en línea y aplicaciones web complejas. Aunque ahora trabaja con otras tecnologías, valora mi simplicidad para ciertos proyectos y mi amplia disponibilidad en servicios de hosting.",
      "tellMeMore": "Fui creado por Rasmus Lerdorf en 1994 como un conjunto de scripts Perl para rastrear visitas a su CV en línea. Ahora soy un lenguaje de programación completo, especialmente adecuado para desarrollo web. Puedo estar embebido directamente en HTML o funcionar como un lenguaje de backend puro. Con PHP 8, introduje tipado estático, JIT compilation y muchas mejoras de rendimiento. Impulso sistemas como WordPress, Drupal, Magento, Laravel y Symphony, que son la columna vertebral de millones de sitios web.",
      "didntAsk": "echo 'No hay problema!'; Estaré aquí procesando formularios y conectándome a bases de datos si cambias de idea. ¡Los arrays asociativos y yo te esperamos!"
    },
    "React": {
      "initial": "¡Hola! Soy React, la biblioteca que revolucionó la web. Me encanta ser componente y reutilizable. ¡Y mi hook useState es el más popular de todos! ⚛️",
      "whyCaptured": "Felipe me adora por mi capacidad para crear interfaces de usuario eficientes y mantenibles. Ha construido numerosas aplicaciones conmigo, desde sitios corporativos hasta dashboards complejos y aplicaciones SPA. Domina mis conceptos fundamentales como componentes, hooks, y el manejo de estado. También me ha usado junto con TypeScript, Redux para gestión de estado global, y bibliotecas de UI como Material-UI y Chakra UI. Este portfolio mismo está construido con mis componentes.",
      "tellMeMore": "Fui creado por Facebook en 2013 para resolver un problema específico: construir interfaces de usuario a gran escala con datos que cambian constantemente. Mi principal innovación es el Virtual DOM, que permite actualizar eficientemente solo las partes que cambian en la UI. Estoy basado en componentes reutilizables que encapsulan su propio estado y lógica. En 2019, introduje los Hooks, que revolucionaron cómo se maneja el estado y los efectos secundarios. Tengo un ecosistema enorme de librerías y herramientas complementarias.",
      "didntAsk": "function Entendido() { return <p>Me mantendré en mi propio componente entonces.</p> } Estaré aquí, renderizando silenciosamente, cuando necesites una UI interactiva."
    },
    "Node.js": {
      "initial": "¡Hey! Soy Node.js, llevo JavaScript al servidor. Soy rápido, asíncrono y tengo miles de paquetes en npm. ¡El mundo del backend nunca fue tan divertido! 🚀",
      "whyCaptured": "Felipe me ha utilizado extensivamente para crear APIs RESTful y servicios backend. Valora mi modelo no bloqueante basado en eventos que permite manejar múltiples conexiones simultáneas con eficiencia. Ha desarrollado microservicios, herramientas CLI y servidores web utilizando frameworks como Express y NestJS. También me usa para automatizar flujos de trabajo de desarrollo con scripts personalizados y herramientas de build.",
      "tellMeMore": "Fui creado por Ryan Dahl en 2009, llevando el motor V8 de Chrome fuera del navegador. Mi mayor fortaleza es el modelo de E/S no bloqueante basado en eventos, ideal para aplicaciones en tiempo real que manejan muchas conexiones simultáneas. Tengo el ecosistema de paquetes más grande del mundo (npm) con más de 1.3 millones de bibliotecas. Soy multipropósito: sirvo desde APIs y aplicaciones web hasta herramientas de línea de comandos, servicios en tiempo real, y scripts de automatización.",
      "didntAsk": "Entendido. process.exit(0); Volveré a mi event loop. Si necesitas procesar datos de forma asíncrona, estaré esperando tu callback."
    },
    "Next.js": {
      "initial": "¡Saludos! Soy Next.js, el framework que hace que React brille aún más. SSR, SSG, ISR... ¡tengo todas las siglas que necesitas! 🌟",
      "whyCaptured": "Felipe me eligió para llevar sus aplicaciones React al siguiente nivel. Aprecia mis capacidades de renderizado híbrido que mejoran el SEO y el rendimiento inicial de carga. Ha utilizado mis funciones de generación estática (SSG) y renderizado del lado del servidor (SSR) para crear sitios rápidos y optimizados. También valora mi sistema de enrutamiento basado en archivos, mi soporte para API routes, y mi optimización automática de imágenes.",
      "tellMeMore": "Fui creado por Vercel en 2016 como un framework para aplicaciones React. Ofrezco múltiples estrategias de renderizado: Server-Side Rendering (SSR), Static Site Generation (SSG), Incremental Static Regeneration (ISR) y Client-Side Rendering cuando es apropiado. Mi sistema de rutas basado en archivos hace que la navegación sea intuitiva. Optimizo automáticamente imágenes, fuentes y scripts para mejor rendimiento. También incluyo API routes para crear endpoints backend integrados en tu aplicación, eliminando la necesidad de un servidor separado.",
      "didntAsk": "export default function Goodbye() { return <p>Entendido. Me quedaré en mi carpeta pages/ hasta que decidas navegar hacia mí.</p> }"
    },
    "Wordpress": {
      "initial": "¡Hola! Soy WordPress, el CMS más popular del mundo. ¡Impulso el 43% de la web! Plugins, temas... ¡tengo de todo! 📝",
      "whyCaptured": "Felipe ha trabajado extensivamente conmigo en proyectos para clientes que necesitan gestionar su contenido fácilmente. Ha desarrollado temas personalizados, creado plugins a medida, e integrado APIs externas para extender mis capacidades. Aprecia mi flexibilidad para crear desde blogs simples hasta complejas tiendas online con WooCommerce. Mi interfaz amigable para el usuario final también le permite entregar proyectos que sus clientes pueden mantener por sí mismos.",
      "tellMeMore": "Nací en 2003 como una plataforma de blogging, pero he evolucionado hasta convertirme en un sistema de gestión de contenido completo y versátil. Estoy construido con PHP y MySQL, y uso un sistema de plantillas para separar el contenido de la presentación. Mi arquitectura de plugins permite extender mi funcionalidad infinitamente - ¡hay más de 59,000 plugins disponibles! Con WooCommerce, me convierto en una poderosa plataforma de e-commerce. Mi editor de bloques Gutenberg revolucionó la forma en que se crea contenido web.",
      "didntAsk": "No hay problema. Volveré a mi panel de administración. Si necesitas publicar contenido o gestionar una web, estaré esperando tu login."
    },
    "Python": {
      "initial": "¡Hola! Soy Python, el lenguaje más amigable que conocerás. Me encanta la IA, el análisis de datos y la simplicidad. ¡Incluso las serpientes reales me tienen envidia! 🐍",
      "whyCaptured": "Felipe me utiliza principalmente para proyectos de análisis de datos, automatización y scripts de utilidad. Ha aprovechado mis bibliotecas como Pandas para manipulación de datos, matplotlib para visualizaciones, y Scikit-learn para implementar algoritmos de machine learning en algunos proyectos. También ha creado scripts de automatización para tareas repetitivas y webscrapers para extraer datos. Valora mi sintaxis clara y legible que permite implementar soluciones rápidamente.",
      "tellMeMore": "Fui creado por Guido van Rossum en 1991 con un enfoque en la legibilidad del código. Mi filosofía se resume en el 'Zen de Python': simple es mejor que complejo, la legibilidad cuenta, y debe haber una manera obvia de hacer las cosas. Soy un lenguaje interpretado, de tipado dinámico y multiparadigma que soporta programación orientada a objetos, imperativa y funcional. Mi ecosistema es increíblemente rico: desde análisis de datos (Pandas, NumPy) hasta machine learning (TensorFlow, PyTorch), web frameworks (Django, Flask), y automatización. Mi comunidad es una de las más activas y acogedoras.",
      "didntAsk": "def entendido(): pass  # No hay problema, seré tan minimalista como mi sintaxis. Estaré en mi entorno virtual si me necesitas para algún análisis."
    },
    "Firebase": {
      "initial": "¡Hola! Soy Firebase, tu backend en la nube. Autenticación, base de datos en tiempo real, hosting... ¡Lo hago todo! ¡Y en tiempo real! 🔥",
      "whyCaptured": "Felipe me ha integrado en numerosos proyectos que requieren funcionalidades backend sin la complejidad de configurar servidores. Ha utilizado mi autenticación de usuarios, Firestore para bases de datos, Cloud Functions para lógica de servidor, y mi hosting para desplegar aplicaciones web. Especialmente valora mi sincronización en tiempo real que permite crear experiencias colaborativas y aplicaciones reactivas sin escribir código complejo de servidor.",
      "tellMeMore": "Comencé en 2011 como una base de datos en tiempo real, pero Google me adquirió en 2014 y me transformó en una plataforma completa de desarrollo de aplicaciones. Ofrezco servicios que cubren todo el ciclo de desarrollo: desde autenticación y almacenamiento hasta análisis y monetización. Mi base de datos en tiempo real sincroniza datos entre clientes instantáneamente. Firestore, mi base de datos más reciente, combina lo mejor de las bases de datos NoSQL con potentes consultas y escalabilidad automática. También ofrezco ML Kit para integrar machine learning, Cloud Functions para lógica de backend, y Analytics para entender el comportamiento de los usuarios.",
      "didntAsk": "Solicitud cancelada. Volveré a escuchar eventos en tiempo real. Estaré aquí, manteniendo tus datos sincronizados, cuando cambies de opinión."
    },
    "Docker": {
      "initial": "¡Ahoy! Soy Docker, el rey de los contenedores. Empaqueto aplicaciones con todo lo que necesitan. ¡Funciona en mi máquina y en todas las demás! 🐳",
      "whyCaptured": "Felipe me utiliza para asegurar que sus entornos de desarrollo sean consistentes y que sus aplicaciones se puedan desplegar de manera confiable. Ha creado Dockerfiles para varios proyectos, configurado entornos de desarrollo con Docker Compose y trabajado con imágenes para diferentes servicios (Node.js, PostgreSQL, Redis). Valora cómo facilito la colaboración en equipo al eliminar el problema de 'en mi máquina funciona' y cómo simplifico el proceso de despliegue en diferentes entornos.",
      "tellMeMore": "Fui creado en 2013 y revolucioné el desarrollo de software con mi tecnología de contenedores. A diferencia de las máquinas virtuales tradicionales, mis contenedores comparten el kernel del sistema operativo host, lo que los hace extremadamente ligeros y eficientes. Encapsulo aplicaciones con todas sus dependencias, asegurando que funcionen igual en cualquier entorno. Docker Compose permite orquestar múltiples contenedores como servicios interconectados. Soy la base de la arquitectura de microservicios moderna y facilito las prácticas de DevOps y CI/CD.",
      "didntAsk": "ENTRYPOINT [\"exit\"] Contenedor detenido. Estaré en el Docker Hub si necesitas desplegarme de nuevo."
    },
    "Git": {
      "initial": "¡Hola! Soy Git, el guardián del código. Guardo cada cambio que haces y puedo viajar en el tiempo. ¡Nunca perderás tu código conmigo! 🌳",
      "whyCaptured": "Felipe me usa diariamente en todos sus proyectos. Domina mis comandos básicos y avanzados para gestionar el historial de cambios, colaborar en equipo a través de branches y resolver conflictos. Ha configurado flujos de trabajo con GitHub y GitLab para implementar integración continua. Aprecia mi capacidad para mantener un historial detallado de cambios, trabajar en múltiples características simultáneamente mediante branches, y colaborar eficientemente con otros desarrolladores.",
      "tellMeMore": "Fui creado por Linus Torvalds en 2005 para gestionar el desarrollo del kernel de Linux. Soy un sistema de control de versiones distribuido, lo que significa que cada desarrollador tiene una copia completa del repositorio. Mi estructura se basa en snapshots (commits) que forman un grafo dirigido acíclico. Mis características principales incluyen branching y merging eficientes, staging area para preparar commits, y un sistema de tags para versiones. A diferencia de mis predecesores, soy extremadamente rápido, seguro (uso SHA-1 para integridad) y diseñado para manejar proyectos de cualquier tamaño. GitHub, GitLab y Bitbucket han construido plataformas enteras alrededor de mis capacidades.",
      "didntAsk": "git commit -m \"Entendido\". No hay problema, tus cambios han sido registrados. Estaré vigilando silenciosamente tu código desde el directorio .git/"
    },
    "Vite": {
      "initial": "¡Hola! Soy Vite, el build tool más rápido del oeste. HMR instantáneo y builds ultrarrápidos son mi especialidad. ¡Soy veloz como un rayo! ⚡",
      "whyCaptured": "Felipe me adoptó para mejorar significativamente su flujo de desarrollo frontend. Valora mi capacidad para iniciar proyectos instantáneamente sin largos tiempos de compilación, mi Hot Module Replacement (HMR) que refleja cambios en milisegundos, y mi sistema de construcción optimizado para producción. Me ha utilizado en proyectos con React, Vue y Vanilla JS, aprovechando mi sistema de plugins para extender funcionalidades según las necesidades específicas de cada proyecto.",
      "tellMeMore": "Fui creado por Evan You (el creador de Vue.js) en 2020 como respuesta a los lentos tiempos de inicio de los bundlers tradicionales. Mi arquitectura se divide en dos partes: un servidor de desarrollo extremadamente rápido basado en ESM nativo del navegador, y un sistema de construcción para producción basado en Rollup. No requiero un paso de bundling durante el desarrollo, lo que me hace increíblemente rápido. Soporto TypeScript, JSX, CSS modules y preprocesadores CSS directamente. Mi sistema de plugins es compatible con el ecosistema de Rollup, lo que me da acceso a un gran número de extensiones.",
      "didntAsk": "import { silence } from 'respect'; export default silence; // Entendido, volveré a optimizar assets en segundo plano. Estaré disponible en localhost:3000 cuando me necesites."
    },
    "Supabase": {
      "initial": "¡Hey! Soy Supabase, la alternativa open source a Firebase. PostgreSQL, autenticación y APIs en tiempo real. ¡Y todo con SQL! 🚀",
      "whyCaptured": "Felipe me eligió para proyectos que requieren una potente base de datos relacional con funcionalidades modernas. Ha aprovechado mi capa de autenticación, mis APIs RESTful automáticas y mi capacidad de tiempo real para crear aplicaciones web y móviles completas. Valora mi enfoque basado en SQL y PostgreSQL que proporciona flexibilidad y robustez, además de mi condición de plataforma open source que le da más control sobre sus datos.",
      "tellMeMore": "Fui lanzado en 2020 como una alternativa open source a Firebase, pero con PostgreSQL como mi base de datos. Ofrezco autenticación de usuarios, almacenamiento de archivos, funciones edge, y generación automática de APIs REST y GraphQL a partir de tus tablas. Mi característica distintiva es el soporte para suscripciones en tiempo real utilizando websockets. Al estar construido sobre PostgreSQL, tienes acceso a todas sus poderosas características: consultas complejas, funciones, triggers, tipos personalizados y más. También incluyo Postgrest para APIs, GoTrue para autenticación, y Vector para búsquedas semánticas y funciones de IA.",
      "didntAsk": "SELECT understanding FROM responses WHERE asked = false; -- Mensaje recibido. Mantendré tus datos seguros mientras explores otras tecnologías."
    },
    "Laragon": {
      "initial": "¡Hola! Soy Laragon, el entorno de desarrollo más amigable para Windows. Apache, MySQL, PHP... ¡todo en un solo clic! 🎯",
      "whyCaptured": "Felipe me descubrió cuando buscaba un entorno de desarrollo local completo y fácil de usar para Windows. Me ha utilizado principalmente para proyectos PHP, WordPress y Laravel, aprovechando mi interfaz sencilla para crear hosts virtuales automáticamente, cambiar entre versiones de PHP y gestionar bases de datos MySQL. Valora especialmente mi consumo ligero de recursos y la facilidad para configurar nuevos proyectos sin complicaciones.",
      "tellMeMore": "Fui creado como una alternativa moderna a soluciones como XAMPP y WAMP, pero con un enfoque en la simplicidad y el rendimiento. Ofrezco un entorno de desarrollo completo para Windows que incluye Apache/Nginx, MySQL/MariaDB, PHP, Node.js, y muchas herramientas útiles. Mi característica distintiva es la creación automática de hosts virtuales: simplemente crea una carpeta y automáticamente configuro un nombre de dominio local. Soporto múltiples versiones de PHP y bases de datos que puedes cambiar con un clic. También incluyo herramientas como Git, Composer, npm, y Redis para cubrir todas las necesidades de desarrollo web moderno.",
      "didntAsk": "No hay problema. Minimizaré a la bandeja del sistema. Seguiré ejecutando tus servicios en segundo plano hasta que me necesites de nuevo."
    },
    "PostgreSQL": {
      "initial": "¡Saludos! Soy PostgreSQL, la base de datos relacional más avanzada. ACID, JSON nativo y extensiones poderosas. ¡Soy el elefante que nunca olvida tus datos! 🐘",
      "whyCaptured": "Felipe me ha utilizado en proyectos que requieren una base de datos robusta con características avanzadas. Ha aprovechado mis tipos de datos especializados, funciones y procedimientos almacenados, y mi excelente soporte para transacciones ACID. Me ha implementado tanto en aplicaciones personales como empresariales, a menudo junto con ORMs como Prisma o Sequelize para interactuar conmigo desde sus aplicaciones Node.js. Valora especialmente mi soporte nativo para JSON y búsquedas full-text.",
      "tellMeMore": "Mis orígenes se remontan a 1986 en la Universidad de Berkeley, pero he evolucionado constantemente desde entonces. Soy un sistema de gestión de bases de datos objeto-relacional con un fuerte enfoque en extensibilidad, estándares y robustez. Ofrezco soporte completo para transacciones ACID, claves foráneas, joins, vistas, triggers y procedimientos almacenados. Mis características distintivas incluyen tipos de datos avanzados (arrays, JSON, hstore, rangos), índices sofisticados (GIN, GiST, BRIN), particionamiento de tablas, replicación, y un potente sistema de extensiones. A diferencia de muchas bases de datos NoSQL, combino la flexibilidad de documentos JSON con la potencia y consistencia de las bases de datos relacionales.",
      "didntAsk": "ROLLBACK; -- Transacción cancelada. Volveré a mi estado consistente. Tus datos seguirán seguros en mis tablas mientras exploras otras tecnologías."
    },
    "Expo": {
      "initial": "¡Hola! Soy Expo, el framework de desarrollo de aplicaciones móviles más rápido. Creo aplicaciones nativas para Android y iOS sin necesidad de aprender lenguajes específicos. ¡Soy la velocidad y la simplicidad en una! 🚀",
      "whyCaptured": "Felipe me ha elegido para proyectos que requieren una rápida creación de aplicaciones móviles con características avanzadas. Ha aprovechado mi capacidad para crear aplicaciones nativas para Android y iOS sin necesidad de aprender lenguajes específicos, mi integración con React Native para una experiencia de desarrollo más sencilla, y mi soporte para características como la autenticación, el almacenamiento de archivos, y las notificaciones push. Valora especialmente mi capacidad para simplificar el desarrollo móvil y mi enfoque en la velocidad y la eficiencia.",
      "tellMeMore": "Fui creado por Facebook en 2016 como una forma de simplificar el desarrollo de aplicaciones móviles. Soy un framework basado en React Native que te permite crear aplicaciones nativas para Android y iOS sin necesidad de aprender lenguajes específicos. Ofrezco una amplia gama de características, incluyendo autenticación, almacenamiento de archivos, notificaciones push, y más. Mi enfoque está en la velocidad y la eficiencia, lo que te permite crear aplicaciones móviles de alta calidad en un corto período de tiempo.",
      "didntAsk": "import { AppLoading } from 'expo'; // Entendido, cancelar carga. Estaré listo para tu próximo proyecto móvil."
    },
    "MongoDB": {
      "initial": "¡Hola! Soy MongoDB, la base de datos NoSQL más popular. Almaceno datos en documentos JSON y escalas horizontalmente. ¡Soy flexibilidad y escalabilidad en una! 🚀",
      "whyCaptured": "Felipe me ha elegido para proyectos que requieren una base de datos escalable y flexible. Ha aprovechado mi capacidad para almacenar grandes cantidades de datos en documentos JSON, mi escalabilidad horizontal para manejar crecimientos rápidos, y mi soporte para consultas complejas. Valora especialmente mi capacidad para adaptarse a cambios en los esquemas de datos y mi enfoque en la escalabilidad.",
      "tellMeMore": "Fui creado en 2009 como una alternativa a las bases de datos relacionales tradicionales. Soy una base de datos NoSQL que almacena datos en documentos JSON, lo que me permite escalar horizontalmente y manejar grandes cantidades de datos. Ofrezco un lenguaje de consulta poderoso, índices para mejorar el rendimiento, y un modelo de datos flexible que se adapta a los cambios en los esquemas de datos.",
      "didntAsk": "db.collection.insertOne(); // Entendido, cancelar inserción. Estaré lista para tu próximo proyecto."
    }

  }
} 